eisup_2019_docmng_integration/src/Documents/абс_РаспределяемыеДоходыРасходы/абс_РаспределяемыеДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РаспределяемыеДоходыРасходы</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыРаспределенияДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижений</name>
    <type>
      <types>DocumentRef.ОперацияБух</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииРаспределния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальникОтделаСводнойОтчетности</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКРаспределению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДляПечати</name>
    <type>
      <types>CatalogRef.абс_НомераДляПечати</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммарныйКоэффициентРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСуммаКРаспределению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммарныйКоэффициентРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСуммаКРаспределению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.абс_ВидыДеятельностиКТТК</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеПриемник</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СформированныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.абс_АВИЗО</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовРаспреденияДоходовРасходов/абс_ИзменениеСтатусовРаспреденияДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовРаспреденияДоходовРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходыСводнаяВедомость</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.абс_СтатусыРаспределенияДоходовРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеФЦ/абс_СоответствиеФЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеФЦ</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СоответствиеПодразделенийИПодразделенийОрганизаций/СоответствиеПодразделенийИПодразделенийОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеПодразделенийИПодразделенийОрганизаций</name>
  <comment>Соответствие подразделений и подразделений организаций</comment>
  <dimensions>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <comment>Подразделение организации</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыРаспределенияДоходовРасходов/абс_СтатусыРаспределенияДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыРаспределенияДоходовРасходов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ПереводВФилиал</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ПереводВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/Подразделения/Подразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Подразделения</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВидПодразделения</name>
    <type>
      <types>EnumRef.ВидыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦФО</name>
    <type>
      <types>CatalogRef.ВидыЦФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ФинансовоеОбязательство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФОИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФОИспользуетсяДЗО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НаименованиеПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ГодИспользования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФОИспользуетсяКТТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипПодразделенияОрганизации</name>
    <type>
      <types>EnumRef.абс_ТипыПодразделенийОрганизации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_ПериодыИспользования</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_ЦФУ/абс_ЦФУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ЦФУ</name>
  <attributes>
    <name>ФинансовоеОбязательство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксДокументовПоЦФУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУИспользуетсяДЗО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеиспользованиеВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеиспользованиеВОтчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьОтветственные</name>
    <attributes>
      <name>ОтветственныйСотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ПериодыИспользования</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/абс_РаспределяемыеДоходыРасходы/Forms/ФормаДокумента/Module.bsl
&НаСервере
Перем мТекущийПользователь;

&НаСервере
Перем мРолиПользователя;
  

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьДвиженияПоОперации(НаправлениеПереноса)
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СформироватьДвиженияПоОперации(НаправлениеПереноса);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументДвижений()
	СформироватьДвиженияПоОперации("-"); 
КонецПроцедуры

&НаСервере
Процедура СФормироватьДокументАвизо()
	СформироватьДвиженияПоОперации("+"); 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьДокументКТТК()
	
	Если Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Исполнение ИЛИ  Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВФилиал ИЛИ Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВКЦ  Тогда
		Элементы.Декорация1.Видимость = Истина;	
		Если ЗначениеЗаполнено(Объект.ДокументДвижений) Тогда
			Элементы.Декорация1.Заголовок = Строка(Объект.ДокументДвижений);	
		Иначе
			
			ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");
			
			Если ОрганизацияКТТК <> Объект.Организация Тогда
				Элементы.Декорация1.Заголовок = "Сформировать проводки по филиалу  ";	
			Иначе
				Элементы.Декорация1.Заголовок = "Сформировать проводки по КТТК  ";	
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Элементы.Декорация1.Видимость = Ложь;	
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПоСтатусу()
	
	Если Объект.Статус <> Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Подготовка Тогда
		РежимТолькоПросмотр = Истина;
	Иначе	
		РежимТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Элементы.ЦФО.ТолькоПросмотр           =  РежимТолькоПросмотр;
	Элементы.ЦФУ.ТолькоПросмотр           =  РежимТолькоПросмотр;
	//Элементы.Группа1.ТолькоПросмотр     =  РежимТолькоПросмотр;
	Элементы.Номер.ТолькоПросмотр         =  РежимТолькоПросмотр;
	Элементы.Дата.ТолькоПросмотр          =  РежимТолькоПросмотр;
	Элементы.Комментарий.ТолькоПросмотр   =  РежимТолькоПросмотр;
	Элементы.тчДоходы.ТолькоПросмотр      =  РежимТолькоПросмотр;
	Элементы.тчРасходы.ТолькоПросмотр     =  РежимТолькоПросмотр;
	Элементы.Дополнительно.ТолькоПросмотр =  РежимТолькоПросмотр;
    Элементы.ВариантЗаполнения.ТолькоПросмотр   =  РежимТолькоПросмотр;
	Элементы.СуммаКРаспределению.ТолькоПросмотр =  РежимТолькоПросмотр;
    Элементы.ДоходыЗаполнитьНДС.Доступность =    Не РежимТолькоПросмотр;
    Элементы.Организация.ТолькоПросмотр 	 =   РежимТолькоПросмотр;
	
	//	Элементы.СтатьяБюджета.ТолькоПросмотр =  РежимТолькоПросмотр;
	Элементы.ВидОперации.ТолькоПросмотр   =	 РежимТолькоПросмотр;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Статус.ТолькоПросмотр  = Ложь;	
	КонецЕсли;	
	
	Если Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВФилиал ИЛИ Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВКЦ Тогда
		Элементы.Группа8.Видимость = Истина;	
		
		Элементы.тчРасходы.ТолькоПросмотр     =  Ложь;
		
	Иначе	
		Элементы.Группа8.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхСтатусов() Экспорт	
	
	СтруктураПараметров = Новый Структура("ЦФО, Организация, Ответственный, ТекущийСтатус, Статус");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Объект);
	СтруктураПараметров.ТекущийСтатус = Объект.Ссылка.Статус;
	
	МассивДоступныхСтатусов = РегистрыСведений.абс_ИзменениеСтатусовРаспреденияДоходовРасходов.ПолучитьСписокДоступныхСтатусво(СтруктураПараметров, 
															глЗначениеПеременной("глТекущийПользователь"), 
															мРолиПользователя);  
															
	Если ПараметрыСеанса.абс_НастройкиСистемы.БлокироватьРучноеСогласованиеРаспределенияДоходы Тогда 	
		ОграниченныеСтатусы = Новый Массив;
		ОграниченныеСтатусы.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВФилиал);
		ОграниченныеСтатусы.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВКЦ);
        ОграниченныеСтатусы.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Исполнение);
        ОграниченныеСтатусы.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ОбработкаБухгалтером);
		
		Для й = 1 - МассивДоступныхСтатусов.Количество() по 0 Цикл 
			Если (ОграниченныеСтатусы.Найти(МассивДоступныхСтатусов[-й]) <> Неопределено) И (МассивДоступныхСтатусов[-й] <> Объект.Статус) Тогда 
				МассивДоступныхСтатусов.Удалить(-й);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
																														
	Элементы.Статус.СписокВыбора.ЗагрузитьЗначения(МассивДоступныхСтатусов);
	
КонецПроцедуры

&НаСервере
Функция СпрашиватьПричинуИзмененияСтатуса()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СпрашиватьПричину = НЕ Объект.Статус = Объект.Ссылка.Статус;
	
	Возврат СпрашиватьПричину;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФайлы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Сначало надо записать документ.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ВладелецФайла", Объект.Ссылка);
	ОткрытьФорму("Справочник.ХранилищеДополнительнойИнформации.Форма.ФормаСпискаУправляемая", ПараметрыФормы);

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормы()
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Элементы.Статус.СписокВыбора.НайтиПоЗначению(мСтатус) = Неопределено Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Выбран неверный статус документа");
		
		мСтатус = Объект.Статус;
		
		Возврат;
	КонецЕсли;
	
	Объект.Статус = мСтатус;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь"); 
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Статус.ТолькоПросмотр = Истина;
		Объект.ПричинаИзмененияСтатуса = "";
		Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Подготовка;
		Объект.Организация			= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "ОсновнаяОрганизация");
		Объект.Ответственный 		= мТекущийПользователь;
		ИсторияСтатусов.Параметры.УстановитьЗначениеПараметра("Документ",Документы.абс_РаспределяемыеДоходыРасходы.ПустаяСсылка());
		Объект.ДокументДвижений     = "";
		Объект.СформированныеДокументы.Очистить();
	Иначе	
		ИсторияСтатусов.Параметры.УстановитьЗначениеПараметра("Документ",Объект.Ссылка);
	КонецЕсли;	
	
	ЗаполнитьСписокДоступныхСтатусов();
	ЗаполнитьПодразделенияОрганизаций();
	//УстановитьОтборИзмененияСтатусов();
	мСтатус = Объект.Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементовФормы();
	УстановитьДоступностьПоСтатусу();
	УстановитьНадписьДокументКТТК();
	ИзменитьВидимостьДоходыРасходы();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ПричинаИзмененияСтатуса = "";
	
	//Если Объект.Ссылка.Статус  = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Подготовка Тогда
	//	ПроверкаЗаполненияДокумента(Отказ);	
	//КонецЕсли;
	
	Если СпрашиватьПричинуИзмененияСтатуса() Тогда
		
		Если Не Отказ Тогда
			ВвестиСтроку(Объект.ПричинаИзмененияСтатуса, "Введите причину изменения статуса",,Истина);
			
			Если Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Исполнение Тогда
				СформироватьДокументДвижений();	
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступностьПоСтатусу();
	ЗаполнитьСписокДоступныхСтатусов();
	УстановитьНадписьДокументКТТК();
	
	ИсторияСтатусов.Параметры.УстановитьЗначениеПараметра("Документ",Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределяемыеДоходыРасходыФилиалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элементы.Доходы.ТекущиеДанные <> Неопределено Тогда	
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Документ.абс_РаспределяемыеДоходыРасходы.Форма.ФормаПодборФилиала",Новый Структура("Организация",Объект.Организация));
		
		//ФормаВыбораОрганизации.РежимВыбора = Истина;
		//
		//РезультатВыбора = ФормаВыбораОрганизации.ОткрытьМодально();
		//
		//Если РезультатВыбора = Неопределено Тогда
		//	Возврат;
		//КонецЕсли;
		//
		//Элементы.Доходы.ТекущиеДанные.Филиал = РезультатВыбора;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределяемыеДоходыРасходыФилиалАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	Если Элементы.Расходы.ТекущиеДанные <> Неопределено Тогда	
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Документ.абс_РаспределяемыеДоходыРасходы.Форма.ФормаПодборФилиала",Новый Структура("Организация",Объект.Организация));
		
		//ФормаВыбораОрганизации = Справочники.Организации.ПолучитьФормуВыбора();
		//Отбор = ФормаВыбораОрганизации.Отбор.абс_СтатусОрганизации;
		//Отбор.ВидСравнения 	    = ВидСравнения.Равно;
		//Отбор.Значение 		    = Перечисления.абс_СтатусОрганизации.Филиал;
		//Отбор.Использование 	= Истина;
		//
		//ФормаВыбораОрганизации.РежимВыбора = Истина;
		//
		//РезультатВыбора = ФормаВыбораОрганизации.ОткрытьМодально();
		//
		//Если РезультатВыбора = Неопределено Тогда
		//	Возврат;
		//КонецЕсли;
		//
		//Элементы.РаспределяемыеДоходыРасходы.ТекущиеДанные.Филиал = РезультатВыбора;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределяемыеДоходыРасходыФилиалОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	//Если Элементы.РаспределяемыеДоходыРасходы.ТекущиеДанные <> Неопределено Тогда	
	СтандартнаяОбработка = Ложь;
	//	
	//	ФормаВыбораОрганизации = Справочники.Организации.ПолучитьФормуВыбора();
	//	Отбор = ФормаВыбораОрганизации.Отбор.абс_СтатусОрганизации;
	//	Отбор.ВидСравнения 	    = ВидСравнения.Равно;
	//	Отбор.Значение 		    = Перечисления.абс_СтатусОрганизации.Филиал;
	//	Отбор.Использование 	= Истина;
	//	
	//	ФормаВыбораОрганизации.РежимВыбора = Истина;
	//	
	//	РезультатВыбора = ФормаВыбораОрганизации.ОткрытьМодально();
	//	
	//	Если РезультатВыбора = Неопределено Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Элементы.РаспределяемыеДоходыРасходы.ТекущиеДанные.Филиал = РезультатВыбора;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределяемыеРасходыФилиалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элементы.Расходы.ТекущиеДанные <> Неопределено Тогда	
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Документ.абс_РаспределяемыеДоходыРасходы.Форма.ФормаПодборФилиала",Новый Структура("Организация",Объект.Организация));

		//ФормаВыбораОрганизации = Справочники.Организации.ПолучитьФормуВыбора();
		//Отбор = ФормаВыбораОрганизации.Отбор.абс_СтатусОрганизации;
		//Отбор.ВидСравнения 	    = ВидСравнения.Равно;
		//Отбор.Значение 		    = Перечисления.абс_СтатусОрганизации.Филиал;
		//Отбор.Использование 	= Истина;
		//
		//ФормаВыбораОрганизации.РежимВыбора = Истина;
		//
		//РезультатВыбора = ФормаВыбораОрганизации.ОткрытьМодально();
		//
		//Если РезультатВыбора = Неопределено Тогда
		//	Возврат;
		//КонецЕсли;
		//
		//Элементы.Расходы.ТекущиеДанные.Филиал = РезультатВыбора;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределяемыеРасходыФилиалАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	Если Элементы.Расходы.ТекущиеДанные <> Неопределено Тогда	
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Документ.абс_РаспределяемыеДоходыРасходы.Форма.ФормаПодборФилиала",Новый Структура("Организация",Объект.Организация));
		
		//ФормаВыбораОрганизации = Справочники.Организации.ПолучитьФормуВыбора();
		//Отбор = ФормаВыбораОрганизации.Отбор.абс_СтатусОрганизации;
		//Отбор.ВидСравнения 	    = ВидСравнения.Равно;
		//Отбор.Значение 		    = Перечисления.абс_СтатусОрганизации.Филиал;
		//Отбор.Использование 	= Истина;
		//
		//ФормаВыбораОрганизации.РежимВыбора = Истина;
		//
		//РезультатВыбора = ФормаВыбораОрганизации.ОткрытьМодально();
		//
		//Если РезультатВыбора = Неопределено Тогда
		//	Возврат;
		//КонецЕсли;
		//
		//Элементы.Расходы.ТекущиеДанные.Филиал = РезультатВыбора;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределяемыеРасходыФилиалОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	//Если Элементы.РаспределяемыеДоходыРасходы.ТекущиеДанные <> Неопределено Тогда	
	СтандартнаяОбработка = Ложь;
	//	
	//	ФормаВыбораОрганизации = Справочники.Организации.ПолучитьФормуВыбора();
	//	Отбор = ФормаВыбораОрганизации.Отбор.абс_СтатусОрганизации;
	//	Отбор.ВидСравнения 	    = ВидСравнения.Равно;
	//	Отбор.Значение 		    = Перечисления.абс_СтатусОрганизации.Филиал;
	//	Отбор.Использование 	= Истина;
	//	
	//	ФормаВыбораОрганизации.РежимВыбора = Истина;
	//	
	//	РезультатВыбора = ФормаВыбораОрганизации.ОткрытьМодально();
	//	
	//	Если РезультатВыбора = Неопределено Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Элементы.РаспределяемыеДоходыРасходы.ТекущиеДанные.Филиал = РезультатВыбора;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВыбораЦФО = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Объект.ЦФУ) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	абс_СоответствиеФЦ.Организация,
		                      |	абс_СоответствиеФЦ.ЦФО
		                      |ИЗ
		                      |	РегистрСведений.абс_СоответствиеФЦ КАК абс_СоответствиеФЦ
		                      |ГДЕ
		                      |	абс_СоответствиеФЦ.ЦФУ = &ЦФУ
		                      |	И абс_СоответствиеФЦ.Организация = &Организация");
		
		Запрос.УстановитьПараметр("ЦФУ"			, Объект.ЦФУ);
		Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
		
		ВыборкаФЦ = Запрос.Выполнить().Выбрать();
		//ВыборкаФЦ = РегистрыСведений.абс_СоответствиеФЦ.Выбрать(Новый Структура("ЦФУ", ЦФУ));
		
		СписокВыбораЦФО.Очистить();
		
		Пока ВыборкаФЦ.Следующий() Цикл			
			СписокВыбораЦФО.Добавить(ВыборкаФЦ.ЦФО);
		КонецЦикла;
		
		СтандартнаяОбработка = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ФормаВыбораЦФО = Справочники.Подразделения.ПолучитьФормуВыбора();
	
	Если СписокВыбораЦФО.Количество() > 0 Тогда
		
		ОтборСсылка = ФормаВыбораЦФО.Отбор.Ссылка;
		
		ОтборСсылка.ВидСравнения 	= ВидСравнения.ВСписке;
		ОтборСсылка.Значение 		= СписокВыбораЦФО;
		ОтборСсылка.Использование 	= Истина;
	КонецЕсли;
	
	ФормаВыбораЦФО.Отбор.абс_ЦФОИспользуется.Установить(Истина);
	
	//Если ЗначениеЗаполнено(Организация) Тогда
	//	ФормаВыбораЦФО.Отбор.Владелец.Установить(Организация);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЦФО) Тогда
		// Установить выбранный ЦФО в списке
	КонецЕсли;
	
	//ФормаВыбораЦФО.Отбор.абс_ФинансовоеОбязательство.Установить(Истина);
	//ФормаВыбораЦФО.ЭлементыФормы.СправочникСписок.НастройкаОтбора.абс_ФинансовоеОбязательство.Доступность = Ложь;
	
	ФормаВыбораЦФО.РежимВыбора = Истина;
	
	РезультатВыбора = ФормаВыбораЦФО.ОткрытьМодально();
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ЦФО = РезультатВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦФУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВыбораЦФУ = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Объект.ЦФО) Тогда
		
		ВыборкаФЦ = РегистрыСведений.абс_СоответствиеФЦ.Выбрать(Новый Структура("ЦФО", Объект.ЦФО));
		
		СписокВыбораЦФУ.Очистить();
		
		Пока ВыборкаФЦ.Следующий() Цикл
			СписокВыбораЦФУ.Добавить(ВыборкаФЦ.ЦФУ);
		КонецЦикла;
		
		СтандартнаяОбработка = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ФормаВыбораЦФУ = Справочники.абс_ЦФУ.ПолучитьФормуВыбора();
	
	Если СписокВыбораЦФУ.Количество() > 0 Тогда
		
		ОтборСсылка = ФормаВыбораЦФУ.Отбор.Ссылка;
		
		ОтборСсылка.ВидСравнения 	= ВидСравнения.ВСписке;
		ОтборСсылка.Значение 		= СписокВыбораЦФУ;
		ОтборСсылка.Использование 	= Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЦФУ) Тогда
		// Установить выбранный ЦФУ в списке 
	КонецЕсли;
	
	//ФормаВыбораЦФУ.Отбор.ФинансовоеОбязательство.Установить(Истина);
	//ФормаВыбораЦФУ.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ФинансовоеОбязательство.Доступность = Ложь;
	
	ФормаВыбораЦФУ.РежимВыбора = Истина;
	
	РезультатВыбора = ФормаВыбораЦФУ.ОткрытьМодально();
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ЦФУ = РезультатВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦФУПриИзменении(Элемент)
	
	Если Объект.ЦФУ <> Неопределено Тогда
		
		Если Не Объект.ЦФУ.абс_Используется Тогда
			ТекстСообщения = "Выбранный ЦФУ """ + СокрЛП(Объект.ЦФУ) + """ не используется.";
			
			Предупреждение(ТекстСообщения,10);
			
			Объект.ЦФУ = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументДвижений) Тогда
		ОткрытьЗначение(Объект.ДокументДвижений);
	Иначе
		Если Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Исполнение Тогда
			СформироватьДокументДвижений();
			УстановитьНадписьДокументКТТК();
			
			ПараметрыЗаписи = Новый Структура("РежимЗаписи");
			ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
			ЭтаФорма.Записать(ПараметрыЗаписи);
			Модифицированность = Ложь;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументПоФилиалу(Команда)
	
	//ОткрытьФорму("Документ.абс_РаспределяемыеДоходыРасходы.Форма.ФормаПодборФилиала",,ЭтаФорма);
	СФормироватьДокументАвизо();
	//Модифицированность = Истина;
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи");
	ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
	ЭтаФорма.Записать(ПараметрыЗаписи);
	Модифицированность = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыНоменклатурнаяГруппаПриИзменении(Элемент)
	Если Элементы.Доходы.ТекущиеДанные <> Неопределено Тогда	
		Элементы.Доходы.ТекущиеДанные.КодБУ = Элементы.Доходы.ТекущиеДанные.НоменклатурнаяГруппа.Код;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоходыСтатьяЗатратПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНоменклатурнаяГруппаПриИзменении(Элемент)
	// Start КТТК Ермолов Е.Л.  25.03.2015 000031830
	//Если Элементы.Расходы.ТекущиеДанные <> Неопределено Тогда	
	//	Элементы.Расходы.ТекущиеДанные.КодБУ = Элементы.Расходы.ТекущиеДанные.НоменклатурнаяГруппа.Код;	
	//КонецЕсли;
	// Stop КТТК Ермолов Е.Л.  25.03.2015
КонецПроцедуры

&НаКлиенте
Процедура РасходыСтатьяЗатратПриИзменении(Элемент)
	// Start КТТК Ермолов Е.Л.  25.03.2015 000031830
	Если Элементы.Расходы.ТекущиеДанные <> Неопределено Тогда	
		Элементы.Расходы.ТекущиеДанные.КодБУ = Элементы.Расходы.ТекущиеДанные.СтатьяЗатрат.Код;	
	КонецЕсли;
	// Stop КТТК Ермолов Е.Л.  25.03.2015
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.СформированныеДокументы.ТекущиеДанные <> Неопределено Тогда	
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элементы.СформированныеДокументы.ТекущиеДанные.Документ);
	КонецЕсли;	
КонецПроцедуры

//Печатные формы

&НаСервере
Функция ПолучитьТабличныйДокументРаспределяемыеДоходыРасходыСервер()
	Документ =  РеквизитФормыВЗначение("Объект");
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьРаспределяемыеДоходыРасходы(Документ);
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументАвизоОРаспределяемыхДоходахСервер(ОтборФилиал,ДокАвизо)
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьАвизоОРаспределяемыхДоходах(ДокАвизо,ОтборФилиал,Объект.НачальникОтделаСводнойОтчетности,ДокАвизо.Номер);
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументАвизоОРаспределяемыхРасходах(ОтборФилиал,ДокАвизо)
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьАвизоОРаспределяемыхРасходах(ДокАвизо,ОтборФилиал,Объект.НачальникОтделаСводнойОтчетности,ДокАвизо.Номер);
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументАвизоОПередаваемыхРасходахСервер(ОтборФилиал,ДокАвизо)
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьАвизоОПередаваемыхРасходах(ДокАвизо,ОтборФилиал,Объект.НачальникОтделаСводнойОтчетности);
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументВедомостьПоРаспределяемымДоходамСервер()
	Документ =  РеквизитФормыВЗначение("Объект");
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьВедомостьПоРаспределяемымДоходам(Документ);
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументВедомостьПоРаспределяемымРасходамПоБлокамСервер()
	Документ =  РеквизитФормыВЗначение("Объект");
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьВедомостьПоРаспределяемымРасходамПоБлокам(Документ);
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументСводнаяВедомостьПоРаспределяемымДоходамСервер()
	Документ =  РеквизитФормыВЗначение("Объект");
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьСводнаяВедомостьПоРаспределяемымДоходам(Документ);
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументРаспределяемыеДоходыРасходы()
	Документ =  РеквизитФормыВЗначение("Объект");
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьРаспределяемыеДоходыРасходы(Документ);
КонецФункции

&НаКлиенте
Процедура ПечатьРаспределяемыеДоходыРасходы(Команда)
	ТабДок = ПолучитьТабличныйДокументРаспределяемыеДоходыРасходы();
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Распределяемые доходы/расходы");
КонецПроцедуры

&НаСервере
Функция ПолучитьВсеФилиалы()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	абс_РаспределяемыеДоходыРасходыСформированныеДокументы.Организация КАК Филиал
	|ИЗ
	|	Документ.абс_РаспределяемыеДоходыРасходы.СформированныеДокументы КАК абс_РаспределяемыеДоходыРасходыСформированныеДокументы
	|ГДЕ
	|	абс_РаспределяемыеДоходыРасходыСформированныеДокументы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_РаспределяемыеДоходыРасходыСформированныеДокументы.Организация";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Функция ЗапроситьФилиалНаПечать()
	
	ВсеФилиалы = ПолучитьВсеФилиалы();
	Филиал = ВсеФилиалы.ВыбратьСтроку("Выберите филиал для печати",);
	Если Филиал <> Неопределено Тогда	
		Возврат Филиал.Филиал; 
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции 



&НаКлиенте
Процедура ПечатьАвизоОПередаваемыхРасходах(Команда)
	ОтборФилиал = ЗапроситьФилиалНаПечать();
	Если ОтборФилиал <> Неопределено Тогда	
		Для каждого Стр Из Объект.СформированныеДокументы Цикл
			Если Стр.Документ.ОрганизацияПриемник = ОтборФилиал Тогда	
				ТабДок = ПолучитьТабличныйДокументАвизоОПередаваемыхРасходахСервер(ОтборФилиал,Стр.Документ);
				УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Авизо о передаваемых расходах");
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАвизоОРаспределяемыхДоходах(Команда)
	ОтборФилиал = ЗапроситьФилиалНаПечать();
	Если ОтборФилиал <> Неопределено Тогда	
		Для каждого Стр Из Объект.СформированныеДокументы Цикл
			Если Стр.Документ.ОрганизацияПриемник = ОтборФилиал Тогда	
				ТабДок = ПолучитьТабличныйДокументАвизоОРаспределяемыхДоходахСервер(ОтборФилиал,Стр.Документ);
				УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Авизо о распределяемых доходах");
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАвизоОРаспределяемыхРасходах(Команда)
	ОтборФилиал = ЗапроситьФилиалНаПечать();
	Если ОтборФилиал <> Неопределено Тогда	
		Для каждого Стр Из Объект.СформированныеДокументы Цикл
			Если Стр.Документ.ОрганизацияПриемник = ОтборФилиал Тогда	
				ТабДок = ПолучитьТабличныйДокументАвизоОРаспределяемыхРасходах(ОтборФилиал,Стр.Документ);
				УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Авизо о распределяемых расходах");
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры



&НаКлиенте
Процедура ПечатьВедомостьПоРаспределяемымДоходам(Команда)
	ТабДок = ПолучитьТабличныйДокументВедомостьПоРаспределяемымДоходамСервер();
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Ведомость по распределяемым доходам");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВедомостьПоРаспределяемымРасходамПоБлокам(Команда)
	ТабДок = ПолучитьТабличныйДокументВедомостьПоРаспределяемымРасходамПоБлокамСервер();
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Ведомость по распределяемымрасходам по блокам");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСводнаяВедомостьПоРаспределяемымДоходам(Команда)
	ТабДок = ПолучитьТабличныйДокументСводнаяВедомостьПоРаспределяемымДоходамСервер();
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Сводная  ведомость по распределяемым доходам");
КонецПроцедуры

&НаКлиенте
Процедура ДоходыСтатьяБюджетаПриИзменении(Элемент)
	Если Элементы.Доходы.ТекущиеДанные <> Неопределено Тогда	
		Элементы.Доходы.ТекущиеДанные.КодУУ = Элементы.Доходы.ТекущиеДанные.СтатьяБюджета.Код;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходыСтатьяБюджетаПриИзменении(Элемент)
	Если Элементы.Расходы.ТекущиеДанные <> Неопределено Тогда	
		Элементы.Расходы.ТекущиеДанные.КодУУ = Элементы.Расходы.ТекущиеДанные.СтатьяБюджета.Код;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Элементы.Расходы.ТекущиеДанные <> Неопределено Тогда	
			Элементы.Расходы.ТекущиеДанные.СчетКт  = ПланыСчетов.Хозрасчетный.РасчетыПоТекущимОперациям;
			Элементы.Расходы.ТекущиеДанные.СчетДт  = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходыНеОблагаемыеЕНВД;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Элементы.Доходы.ТекущиеДанные <> Неопределено Тогда	
			Элементы.Доходы.ТекущиеДанные.СчетДт  =  ПланыСчетов.Хозрасчетный.РасчетыПоТекущимОперациям;
			Элементы.Доходы.ТекущиеДанные.СчетКт  =  ПланыСчетов.Хозрасчетный.ВыручкаНеОблагаемаяЕНВД;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Элементы.Группа1.ТекущаяСтраница = Элементы.Группа1.ПодчиненныеЭлементы.тчДоходы Тогда
		ТекущиеДанные = Элементы.Доходы.ТекущиеДанные;	
	ИначеЕсли Элементы.Группа1.ТекущаяСтраница = Элементы.Группа1.ПодчиненныеЭлементы.тчРасходы Тогда
		ТекущиеДанные =	Элементы.Расходы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
		//Если ЗначениеЗаполнено(ТекущиеДанные.ПодразделениеПриемник) Тогда 
		//	Если ТекущиеДанные.ПодразделениеПриемник.Владелец <> Параметр Тогда 
				Если ЗначениеЗаполнено(ТекущиеДанные.Подразделение) И ЗначениеЗаполнено(ТекущиеДанные.Филиал) Тогда
					ТекущиеДанные.ПодразделениеПриемник = НайтиПодразделениеПриемник(ТекущиеДанные.Подразделение,Параметр);		
				Иначе	
					ТекущиеДанные.ПодразделениеПриемник = "";	
				КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущиеДанные = Неопределено; 	
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Филиал = Параметр;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьВидимостьДоходыРасходы()
	
	Если Объект.ВидОперацииРаспределния = 0 Тогда
		Элементы.тчДоходы.Видимость = Истина;
		Элементы.тчРасходы.Видимость = Ложь;
		Элементы.Группа1.ТекущаяСтраница = Элементы.Группа1.ПодчиненныеЭлементы.тчДоходы;
	Иначе	
		Элементы.тчДоходы.Видимость = Ложь;
		Элементы.тчРасходы.Видимость = Истина;
		Элементы.Группа1.ТекущаяСтраница = Элементы.Группа1.ПодчиненныеЭлементы.тчРасходы;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперацииРаспределния = 0 Тогда
		Объект.Расходы.Очистить();
	Иначе	
		Объект.Доходы.Очистить();     
	КонецЕсли;
	
	Объект.СуммаПоДокументу = 0;
	ИзменитьВидимостьДоходыРасходы();
	
КонецПроцедуры


&НаКлиенте
Процедура ДоходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаПоДокументу = Объект.Доходы.Итог("ОбщаяСуммаКРаспределению");	
КонецПроцедуры


&НаКлиенте
Процедура РасходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаПоДокументу = Объект.Расходы.Итог("ОбщаяСуммаКРаспределению");
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда	
		Если ТекущиеДанные.СчетДт  <> ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходыНеОблагаемыеЕНВД Тогда
			ТекущиеДанные.ВидДеятельности = "";	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ДоходыПослеУдаления(Элемент)
	Объект.СуммаПоДокументу = Объект.Доходы.Итог("ОбщаяСуммаКРаспределению");
КонецПроцедуры


&НаКлиенте
Процедура РасходыПослеУдаления(Элемент)
	Объект.СуммаПоДокументу = Объект.Расходы.Итог("ОбщаяСуммаКРаспределению");
КонецПроцедуры


&НаКлиенте
Процедура ВариантЗаполненияПриИзменении(Элемент)
	
	Если Объект.ВариантЗаполнения = 0 Тогда
		Элементы.СуммаКРаспределению.Видимость = Истина;	
		//Элементы.Доходы.к
	Иначе	
		Элементы.СуммаКРаспределению.Видимость = Ложь;	
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура РасходыСуммарныйКоэффициентРаспределенияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ОбщаяСуммаКРаспределению = (Объект.СуммаКРаспределению * ТекущиеДанные.СуммарныйКоэффициентРаспределения) / 100;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РаспределяемыеДоходыРасходыСуммарныйКоэффициентРаспределенияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Доходы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ОбщаяСуммаКРаспределению = (Объект.СуммаКРаспределению * ТекущиеДанные.СуммарныйКоэффициентРаспределения) / 100;	
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура СуммаКРаспределениюПриИзменении(Элемент)
	
	Если  Объект.ВидОперацииРаспределния = 0 Тогда
		Если Объект.ВариантЗаполнения = 1 Тогда
			Для каждого Стр Из Объект.Доходы Цикл
				Стр.ОбщаяСуммаКРаспределению = (Объект.СуммаКРаспределению * Стр.СуммарныйКоэффициентРаспределения) / 100;	
			КонецЦикла;	
		КонецЕсли;
		Объект.СуммаПоДокументу = Объект.Доходы.Итог("ОбщаяСуммаКРаспределению");	
	Иначе	
		Если Объект.ВариантЗаполнения = 1 Тогда
			Для каждого Стр Из Объект.Расходы Цикл
				Стр.ОбщаяСуммаКРаспределению = (Объект.СуммаКРаспределению * Стр.СуммарныйКоэффициентРаспределения) / 100;	
			КонецЦикла;	
		КонецЕсли;
		Объект.СуммаПоДокументу = Объект.Расходы.Итог("ОбщаяСуммаКРаспределению");	
	КонецЕсли;	
	
	
КонецПроцедуры


&НаКлиенте
Процедура РасходыПодразделениеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда	
		Если ЗначениеЗаполнено(ТекущиеДанные.Подразделение) Тогда
			ТекущиеДанные.ПодразделениеСтр = ТекущиеДанные.Подразделение.Наименование;	
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Подразделение) И ЗначениеЗаполнено(ТекущиеДанные.Филиал) Тогда
				ТекущиеДанные.ПодразделениеПриемник = НайтиПодразделениеПриемник(ТекущиеДанные.Подразделение,ТекущиеДанные.Филиал);	
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНДСНаСервере()
	
	МассивКУдалению = Новый Массив;
	Для каждого Стр Из Объект.Доходы Цикл
		Если Стр.СчетДт = ПланыСчетов.Хозрасчетный.Продажи_НДС Тогда
			МассивКУдалению.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого Стр Из МассивКУдалению Цикл
		Объект.Доходы.Удалить(Стр);
	КонецЦикла;	
	
	ТЗ =  Объект.Доходы.Выгрузить();
	Для каждого Стр Из ТЗ Цикл
		НС = Объект.Доходы.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		
		НС.СчетДт  = ПланыСчетов.Хозрасчетный.Продажи_НДС;
		НС.СчетКт  = ПланыСчетов.Хозрасчетный.РасчетыПоТекущимОперациям;
		
		НС.ОбщаяСуммаКРаспределению =  (НС.ОбщаяСуммаКРаспределению * 18) / 118;
		
	КонецЦикла;
	
	
КонецПроцедуры
 


&НаКлиенте
Процедура ЗаполнитьНДС(Команда)
	ЗаполнитьНДСНаСервере();	
КонецПроцедуры


&НаКлиенте
Процедура РасходыПередУдалением(Элемент, Отказ)
	Если Объект.Статус <> Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Подготовка Тогда
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РасходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Статус <> Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Подготовка Тогда
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры


Процедура ЗаполнитьПодразделенияОрганизаций()

 	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение,
	|	СоответствиеПодразделенийИПодразделенийОрганизаций.Организация,
	|	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	|ИЗ
	|	РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций";
	
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.НайтиПоНаименованию("КТТК"));
	ТзПодразеления.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Функция НайтиПодразделениеПриемник(Подразделение,Организация)
	
	Строки = ТзПодразеления.НайтиСтроки(Новый Структура("ПодразделениеОрганизации",Подразделение));
	
	Если Строки.Количество() > 0 Тогда
		
		Строки1 = ТзПодразеления.НайтиСтроки(Новый Структура("Подразделение,Организация",Строки[0].Подразделение,Организация));
		
		Если Строки1.Количество() > 0 Тогда
			Возврат Строки1[0].ПодразделениеОрганизации; 	
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции
